result = [
    {
        "ID": "ITT1",
        "나이": "32",
        "수강정보": {
            "과거 수강횟수": "0",
            "현재 수강정보": [
                {
                    "강사": "이현구",
                    "강의명": "빅데이터",
                    "강의코드": "bd171106",
                    "개강일": "20171106",
                    "종료일": "20180905"
                }
            ]
        },
        "이름": "전민하",
        "주소": "대구시 서구 원대동3가"
    },
    {
        "ID": "ITT2",
        "나이": "32",
        "수강정보": {
            "과거 수강횟수": "1",
            "현재 수강정보": [
                {
                    "강사": "이현구",
                    "강의명": "빅데이터",
                    "강의코드": "bd171106",
                    "개강일": "20171106",
                    "종료일": "20180905"
                },
                {
                    "강사": "이현구",
                    "강의명": "c언어",
                    "강의코드": "cl180101",
                    "개강일": "20180101",
                    "종료일": "20180601"
                }
            ]
        },
        "이름": "김기정",
        "주소": "대구시 동구 파티마병원옆"
    },
    {
        "ID": "ITT3",
        "나이": "29",
        "수강정보": {
            "과거 수강횟수": "1",
            "현재 수강정보": [
                {
                    "강사": "이현구",
                    "강의명": "c언어",
                    "강의코드": "cl180101",
                    "개강일": "20180101",
                    "종료일": "20180601"
                }
            ]
        },
        "이름": "전수범",
        "주소": "대구시 달서구"
    },
    {
        "ID": "ITT4",
        "나이": "29",
        "수강정보": {
            "과거 수강횟수": "1",
            "현재 수강정보": [
                {
                    "강사": "이현구",
                    "강의명": "파이썬",
                    "강의코드": "py180110",
                    "개강일": "2018-01-10",
                    "종료일": "2018-06-10"
                }
            ]
        },
        "이름": "김인한",
        "주소": "대구시 경대정문앞"
    },
    {
        "ID": "ITT007",
        "나이": "bb",
        "수강정보": {
            "과거 수강횟수": "bb",
            "현재 수강정보": [
                {
                    "강사": "b",
                    "강의명": "b",
                    "강의코드": "bb",
                    "개강일": "b",
                    "종료일": "b"
                },
                {
                    "강사": "b",
                    "강의명": "b",
                    "강의코드": "b",
                    "개강일": "b",
                    "종료일": "b"
                }
            ]
        },
        "이름": "bb",
        "주소": "bb"
    }
]
a = input("입력:")
b = input("변경:")
for i in result:
    if a == i["이름"]:
        del i["이름"]
        i["이름"] = b
        print(i)


# for i in (result[4]["수강정보"]["현재 수강정보"]):
#     if i["강의코드"] == a :
#         print()
